import logging.config
from datetime import datetime, timezone, date




logger = logging.getLogger(__name__)


class ParseModes:
    MARKDOWN_V2 = 'MarkdownV2'
    MARKDOWN = 'Markdown'
    HTML = 'HTML'
    

def escape_markdown_v2(text: str) -> str:
    """ Экранирует специальные символы в строке для использования в режиме ParseMode.MARKDOWN_V2."""
    reserved_chars = '}{[]()>#+=.:,!@/_-'
    for char in reserved_chars:
        text = text.replace(char, f'\\{char}')
    return text


    
CITIES = [
    "Архангельск",
    "Астрахань",
    "Балашиха",
    "Барнаул",
    "Белгород",
    "Брянск",
    "Великий Новгород",
    "Владивосток",
    "Владимир",
    "Волгоград",
    "Вологда",
    "Воронеж",
    "Геленджик",
    "Екатеринбург",
    "Иваново",
    "Ижевск",
    "Иркутск",
    "Казань",
    "Калининград",
    "Калуга",
    "Кемерово",
    "Киров",
    "Кострома",
    "Краснодар",
    "Красноярск",
    "Курган",
    "Курск",
    "Липецк",
    "Люберцы",
    "Москва",
    "Мурманск",
    "Набережные Челны",
    "Нефтеюганск",
    "Нижневартовск",
    "Нижний Новгород",
    "Нижний Тагил",
    "Новороссийск",
    "Новосибирск",
    "Обнинск",
    "Одинцово",
    "Омск",
    "Орел",
    "Оренбург",
    "Орск",
    "Пенза",
    "Пермь",
    "Петрозаводск",
    "Подольск",
    "Псков",
    "Ростов-на-Дону",
    "Рязань",
    "Самара",
    "Санкт-Петербург",
    "Саранск",
    "Саратов",
    "Севастополь",
    "Симферополь",
    "Смоленск",
    "Сочи",
    "Ставрополь",
    "Старый Оскол",
    "Стерлитамак",
    "Сургут",
    "Сыктывкар",
    "Таганрог",    
    "Тамбов",
    "Тверь",
    "Тольятти",
    "Томск",
    "Тула",
    "Тюмень",
    "Улан-Удэ",
    "Ульяновск",
    "Уфа",
    "Хабаровск",
    "Ханты-Мансийск",
    "Химки",
    "Чебоксары",
    "Челябинск",
    "Череповец",
    "Чита",
    "Энгельс",
    "Ялта",
    "Ярославль",
]


unique_first_letters = list(set([city[0].upper() for city in CITIES]))
